IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 X PIC 99 VALUE ZERO.
        77 Y PIC 99 VALUE 1.
        77 INP PIC 99.
        77 RESULT PIC 9999.
        77 ITERATIONNUM PIC 99 VALUE 2.
        77 BASE PIC 9 VALUE 1.
        
PROCEDURE DIVISION.
    DISPLAY X.
    DISPLAY Y.
    ACCEPT INP.
    PERFORM SEQUENCE-PARA INP TIMES.
    STOP RUN.
    
    SEQUENCE-PARA.
    ADD X Y TO RESULT.
    MOVE Y TO X.
    MOVE RESULT TO Y.
    DISPLAY "ITERATION "ITERATIONNUM.
    COMPUTE ITERATIONNUM= ITERATIONNUM+BASE.
    DISPLAY RESULT.
    MOVE ZERO TO RESULT.
